In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:viswaa@localhost

In [2]:
%%sql
use besant;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [ ]:
%%sql
CREATE TABLE sales_data (
    sale_id INT PRIMARY KEY,
    employee_name VARCHAR(50),
    region VARCHAR(50),
    product VARCHAR(50),
    category VARCHAR(50),
    quantity INT,
    price DECIMAL(10,2),
    total_amount DECIMAL(10,2),
    sale_date DATE,
    customer_rating INT
);

In [3]:
%%sql
##Show the total sales amount by region.
SELECT REGION , SUM(TOTAL_AMOUNT)
FROM SALES_DATA
GROUP BY REGION;

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[('North', Decimal('3280.00')),
 ('South', Decimal('3160.00')),
 ('East', Decimal('3560.00')),
 ('West', Decimal('3760.00'))]

In [7]:
%%sql
##Find the average customer rating for each category.
SELECT CATEGORY, AVG(CUSTOMER_RATING) AS AVG_RATING 
FROM SALES_DATA
GROUP BY CATEGORY;

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('Electronics', Decimal('4.4286')),
 ('Furniture', Decimal('4.1429')),
 ('Home Decor', Decimal('4.0000'))]

In [8]:
%%sql
##List employees whose total sales exceed 1000.
SELECT EMPLOYEE_NAME , SUM(TOTAL_AMOUNT) AS TOTAL
FROM SALES_DATA
GROUP BY EMPLOYEE_NAME
HAVING SUM(TOTAL_AMOUNT) > 1000;

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[('Alice', Decimal('1400.00')),
 ('Jack', Decimal('1400.00')),
 ('Kathy', Decimal('1500.00')),
 ('Paul', Decimal('2100.00'))]

In [ ]:
%%sql
##Count the number of distinct products sold in each category.
SELECT CATEGORY , COUNT(DISTINCT PRODUCT) 
FROM SALES_DATA
GROUP BY CATEGORY;

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('Electronics', 3), ('Furniture', 3), ('Home Decor', 2)]

In [10]:
%%sql
##Display products that were sold in more than two transactions.
SELECT PRODUCT , AVG(QUANTITY) AS AVG_QUANTITY
FROM SALES_DATA
group by PRODUCT
HAVING COUNT(*) > 2;

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[('Laptop', Decimal('2.0000')),
 ('Table', Decimal('2.6667')),
 ('Lamp', Decimal('6.3333')),
 ('Curtain', Decimal('3.6667'))]

In [17]:
%%sql
##Show total sales by each employee in each region.
SELECT REGION,employee_name , SUM(TOTAL_AMOUNT) AS TOTAL_SALES
FROM SALES_DATA
GROUP BY REGION, employee_name;

 * mysql+mysqlconnector://root:***@localhost
20 rows affected.

[('North', 'Alice', Decimal('1400.00')),
 ('South', 'Bob', Decimal('900.00')),
 ('East', 'Charlie', Decimal('1000.00')),
 ('West', 'David', Decimal('700.00')),
 ('North', 'Ella', Decimal('400.00')),
 ('South', 'Frank', Decimal('300.00')),
 ('East', 'Grace', Decimal('500.00')),
 ('West', 'Henry', Decimal('240.00')),
 ('North', 'Isla', Decimal('180.00')),
 ('South', 'Jack', Decimal('1400.00')),
 ('East', 'Kathy', Decimal('1500.00')),
 ('West', 'Leo', Decimal('600.00')),
 ('North', 'Mia', Decimal('1000.00')),
 ('South', 'Nina', Decimal('320.00')),
 ('East', 'Oscar', Decimal('360.00')),
 ('West', 'Paul', Decimal('2100.00')),
 ('North', 'Queen', Decimal('300.00')),
 ('South', 'Ryan', Decimal('240.00')),
 ('East', 'Sophia', Decimal('200.00')),
 ('West', 'Tom', Decimal('120.00'))]

In [9]:
%%sql
##Find regions where the average customer rating is greater than 4.
SELECT REGION,AVG(CUSTOMER_RATING) AS AVG_RATING
FROM SALES_DATA
group by REGION
HAVING AVG(CUSTOMER_RATING) > 4;

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('North', Decimal('4.4000')),
 ('East', Decimal('4.2000')),
 ('West', Decimal('4.2000'))]

In [24]:
%%sql
##Show the total quantity of items sold in each category.
SELECT CATEGORY, SUM(QUANTITY) AS TOTAL_QUANTITY_SOLD
FROM SALES_DATA
GROUP BY CATEGORY;

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('Electronics', Decimal('20')),
 ('Furniture', Decimal('19')),
 ('Home Decor', Decimal('30'))]

In [11]:
%%sql
##Display products that have total sales greater than 1500.
SELECT PRODUCT, SUM(TOTAL_AMOUNT)  AS PRODUCT_AMOUNT
FROM SALES_DATA
GROUP BY PRODUCT
HAVING SUM(TOTAL_AMOUNT) > 1500;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[('Laptop', Decimal('5600.00')), ('Mobile', Decimal('2400.00'))]

In [ ]:
%%sql
##List categories along with the number of distinct employees who sold items in them.

In [ ]:
%%sql
##Find the average sale amount for each region and category combination.
SELECT REGION,CATEGORY,AVG(TOTAL_AMOUNT) AS AVG_SALE_AMOUNT
FROM SALES_DATA
GROUP BY REGION, CATEGORY;

 * mysql+mysqlconnector://root:***@localhost
12 rows affected.

[('North', 'Electronics', Decimal('1400.000000')),
 ('South', 'Electronics', Decimal('1150.000000')),
 ('East', 'Electronics', Decimal('1250.000000')),
 ('West', 'Electronics', Decimal('1400.000000')),
 ('North', 'Furniture', Decimal('566.666667')),
 ('South', 'Furniture', Decimal('270.000000')),
 ('East', 'Furniture', Decimal('500.000000')),
 ('West', 'Home Decor', Decimal('180.000000')),
 ('North', 'Home Decor', Decimal('180.000000')),
 ('West', 'Furniture', Decimal('600.000000')),
 ('South', 'Home Decor', Decimal('320.000000')),
 ('East', 'Home Decor', Decimal('280.000000'))]

In [26]:
%%sql
##List employees who sold more than 5 total items.
select employee_name ,sum(quantity) as total_quantity
from sales_data
group by employee_name
having sum(quantity) >5;

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('Henry', Decimal('6')), ('Nina', Decimal('8')), ('Oscar', Decimal('6'))]

In [27]:
%%sql
##Show the average price of products in each category.
select category, product , avg(total_amount) as avg_price
from sales_data
group by product, category;

 * mysql+mysqlconnector://root:***@localhost
8 rows affected.

[('Electronics', 'Laptop', Decimal('1400.000000')),
 ('Electronics', 'Mobile', Decimal('1200.000000')),
 ('Electronics', 'Tablet', Decimal('1000.000000')),
 ('Furniture', 'Chair', Decimal('320.000000')),
 ('Furniture', 'Table', Decimal('400.000000')),
 ('Furniture', 'Sofa', Decimal('750.000000')),
 ('Home Decor', 'Lamp', Decimal('253.333333')),
 ('Home Decor', 'Curtain', Decimal('220.000000'))]

In [12]:
%%sql
##Display categories whose total revenue is greater than 3000.
SELECT CATEGORY , SUM(TOTAL_AMOUNT) 
FROM SALES_DATA
group by CATEGORY
HAVING SUM(TOTAL_AMOUNT)  > 3000;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[('Electronics', Decimal('9000.00')), ('Furniture', Decimal('3340.00'))]

In [ ]:
%%sql
##Find categories where the average quantity sold is more than 3.

In [ ]:
%%sql
##Find regions where the total sales exceed 2000 and display their average rating.

In [ ]:
%%sql
##List employees whose average sale value is greater than 600.

In [ ]:
%%sql
##Show each categoryâ€™s highest and lowest individual sale amount.